Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Inspector_FixedSigned
source: signed
ar: بإشارة
cs: se znaménkem
de: mit Vorzeichen
el: με πρόσημο
es: con signo
fa: علامت‌دار
fr: signé
hu: előjeles
id: bertanda
it: con segno
ja: 符号あり
ko: 부호 있음
pl: ze znakiem
pt: com sinal
ro: cu semn
th: มีเครื่องหมาย
tr: işaretli
uk: зі знаком
vi: có dấu
zh_hans: 有符号
zh_hant: 帶正負號

# Inspector_FixedUnsigned
source: unsigned
ar: بدون إشارة
cs: bez znaménka
de: ohne Vorzeichen
el: χωρίς πρόσημο
es: sin signo
fa: بدون علامت
fr: non signé
hu: előjel nélküli
id: tak bertanda
it: senza segno
ja: 符号なし
ko: 부호 없음
pl: bez znaku
pt: sem sinal
ro: fără semn
th: ไม่มีเครื่องหมาย
tr: işaretsiz
uk: без знака
vi: không dấu
zh_hans: 无符号
zh_hant: 不帶正負號

# Inspector_Unnormal
source: Unnormal representation
ar: تمثيل غير طبيعي
cs: Nenormalizovaná reprezentace
de: Nicht normalisierte Darstellung
el: Μη κανονική αναπαράσταση
es: Representación no normalizada
fa: نمایش غیرعادی
fr: Représentation non normalisée
hu: Nem normalizált ábrázolás
id: Representasi unnormal
it: Rappresentazione non normale
ja: 非正規の表現
ko: 비정규 표현
pl: Reprezentacja nienormalna
pt: Representação não normal
ro: Reprezentare nenormală
th: การแทนค่าแบบ Unnormal
tr: Normal olmayan gösterim
uk: Ненормалізоване подання
vi: Biểu diễn không chuẩn (unnormal)
zh_hans: 非正规表示
zh_hant: 非正規表示

# Inspector_TooLarge64
source: Exceeds 64 bit
ar: يتجاوز 64 بت
cs: Přesahuje 64 bitů
de: Überschreitet 64 Bit
el: Υπερβαίνει τα 64 bit
es: Supera los 64 bits
fa: بیش از 64 بیت
fr: Dépasse 64 bits
hu: Meghaladja a 64 bitet
id: Melebihi 64-bit
it: Supera 64 bit
ja: 64 bit を超えています
ko: 64비트 초과
pl: Przekracza 64 bity
pt: Excede 64 bits
ro: Depășește 64 de biți
th: เกิน 64 บิต
tr: 64 biti aşıyor
uk: Більше за 64 біти
vi: Vượt quá 64 bit
zh_hans: 超过 64 位
zh_hant: 超過 64 位元

# Inspector_StringCounts
source: ({0, plural, one {# char} other {# chars}}, {1, plural, one {# byte} other {# bytes}})
ar: ({0, plural, zero {# حرف} one {حرف واحد} two {حرفان} few {# أحرف} many {# حرفًا} other {# حرف}}، {1, plural, zero {# بايت} one {بايت واحد} two {بايتان} few {# بايتات} many {# بايتًا} other {# بايت}})
cs: ({0, plural, one {# znak} few {# znaky} many {# znaku} other {# znaků}}, {1, plural, one {# bajt} few {# bajty} many {# bajtu} other {# bajtů}})
de: ({0, plural, one {# Zeichen} other {# Zeichen}}, {1, plural, one {# Byte} other {# Bytes}})
el: ({0, plural, one {# χαρακτήρας} other {# χαρακτήρες}}, {1, plural, one {# byte} other {# byte}})
es: ({0, plural, one {# carácter} other {# caracteres}}, {1, plural, one {# byte} other {# bytes}})
fa: ({0, plural, one {# نویسه} other {# نویسه}}، {1, plural, one {# بایت} other {# بایت}})
fr: ({0, plural, one {# caractère} other {# caractères}}, {1, plural, one {# octet} other {# octets}})
hu: ({0, plural, one {# karakter} other {# karakter}}, {1, plural, one {# bájt} other {# bájt}})
id: ({0, plural, other {# karakter}}, {1, plural, other {# byte}})
it: ({0, plural, one {# carattere} other {# caratteri}}, {1, plural, one {# byte} other {# byte}})
ja: ({0} 文字, {1} バイト)
ko: ({0, plural, other {#자}}, {1, plural, other {#바이트}})
pl: ({0, plural, one {# znak} few {# znaki} many {# znaków} other {# znaku}}, {1, plural, one {# bajt} few {# bajty} many {# bajtów} other {# bajtu}})
pt: ({0, plural, one {# caractere} other {# caracteres}}, {1, plural, one {# byte} other {# bytes}})
ro: ({0, plural, one {# caracter} few {# caractere} other {# de caractere}}, {1, plural, one {# octet} few {# octeți} other {# de octeți}})
th: ({0, plural, other {# อักขระ}}, {1, plural, other {# ไบต์}})
tr: ({0, plural, one {# karakter} other {# karakter}}, {1, plural, one {# bayt} other {# bayt}})
uk: ({0, plural, one {# символ} few {# символи} many {# символів} other {# символу}}, {1, plural, one {# байт} few {# байти} many {# байтів} other {# байта}})
vi: ({0, plural, other {# ký tự}}, {1, plural, other {# byte}})
zh_hans: （{0, plural, other {# 个字符}}，{1, plural, other {# 字节}}）
zh_hant: （{0, plural, other {# 個字元}}，{1, plural, other {# 個位元組}}）

# Inspector_NotTerminated
source: No terminator (4 KB or more)
ar: بدون حرف إنهاء (4 KB أو أكثر)
cs: Bez ukončovacího znaku (4 KB nebo více)
de: Kein Abschlusszeichen (4 KB oder mehr)
el: Χωρίς τερματιστή (4 KB ή περισσότερα)
es: Sin terminador (4 KB o más)
fa: بدون پایان‌دهنده (4 KB یا بیشتر)
fr: Pas de terminateur (4 Ko ou plus)
hu: Nincs lezáró karakter (legalább 4 KB)
id: Tanpa terminator (4 KB atau lebih)
it: Nessun terminatore (4 KB o più)
ja: 終端なし (4 KB 以上)
ko: 종결자 없음(4KB 이상)
pl: Brak terminatora (4 KB lub więcej)
pt: Sem terminador (4 KB ou mais)
ro: Fără terminator (4 KB sau mai mult)
th: ไม่มีตัวสิ้นสุด (4 KB ขึ้นไป)
tr: Sonlandırıcı yok (4 KB veya daha fazla)
uk: Немає завершального символу (4 КБ або більше)
vi: Không có ký tự kết thúc (từ 4 KB trở lên)
zh_hans: 无结束符（4 KB 或以上）
zh_hant: 無結尾字元（4 KB 以上）

# Inspector_NotTerminatedAtEnd
source: No terminator before the end of the data
ar: لا يوجد حرف إنهاء قبل نهاية البيانات
cs: Před koncem dat chybí ukončovací znak
de: Kein Abschlusszeichen vor dem Ende der Daten
el: Χωρίς τερματιστή πριν από το τέλος των δεδομένων
es: Sin terminador antes del final de los datos
fa: پیش از پایان داده پایان‌دهنده‌ای نیست
fr: Pas de terminateur avant la fin des données
hu: Nincs lezáró karakter az adatok végéig
id: Tidak ada terminator sebelum akhir data
it: Nessun terminatore prima della fine dei dati
ja: データの末尾まで終端がありません
ko: 데이터 끝까지 종결자 없음
pl: Brak terminatora przed końcem danych
pt: Sem terminador antes do fim dos dados
ro: Fără terminator înainte de sfârșitul datelor
th: ไม่มีตัวสิ้นสุดก่อนจุดสิ้นสุดของข้อมูล
tr: Verinin sonundan önce sonlandırıcı yok
uk: Немає завершального символу до кінця даних
vi: Không có ký tự kết thúc trước cuối dữ liệu
zh_hans: 直到数据末尾都没有结束符
zh_hant: 資料結尾之前沒有結尾字元

# Inspector_KindLocal
source: (local time)
ar: (التوقيت المحلي)
cs: (místní čas)
de: (Ortszeit)
el: (τοπική ώρα)
es: (hora local)
fa: (زمان محلی)
fr: (heure locale)
hu: (helyi idő)
id: (waktu lokal)
it: (ora locale)
ja: (ローカル時刻)
ko: (현지 시간)
pl: (czas lokalny)
pt: (hora local)
ro: (ora locală)
th: (เวลาท้องถิ่น)
tr: (yerel saat)
uk: (місцевий час)
vi: (giờ địa phương)
zh_hans: （本地时间）
zh_hant: （當地時間）

# Inspector_KindUnspecified
source: (unspecified kind)
ar: (نوع غير محدد)
cs: (nezadaný druh)
de: (Art nicht angegeben)
el: (απροσδιόριστο είδος)
es: (tipo no especificado)
fa: (نوع نامشخص)
fr: (type non spécifié)
hu: (nem meghatározott típus)
id: (jenis tidak ditentukan)
it: (tipo non specificato)
ja: (種類の指定なし)
ko: (종류 지정 안 됨)
pl: (rodzaj nieokreślony)
pt: (tipo não especificado)
ro: (tip nespecificat)
th: (ไม่ระบุชนิด)
tr: (belirtilmemiş tür)
uk: (тип не вказано)
vi: (không chỉ định loại)
zh_hans: （未指定种类）
zh_hant: （未指定種類）

# Inspector_DigitsNeeded
source: At least 8 digits are needed ({0} found)
ar: يلزم 8 أرقام على الأقل (تم العثور على {0})
cs: Je potřeba alespoň 8 číslic (nalezeno: {0})
de: Mindestens 8 Ziffern erforderlich ({0} gefunden)
el: Απαιτούνται τουλάχιστον 8 ψηφία (βρέθηκαν {0})
es: Se necesitan al menos 8 dígitos (se encontraron {0})
fa: دست‌کم 8 رقم لازم است ({0} رقم یافت شد)
fr: Au moins 8 chiffres sont nécessaires ({0} trouvés)
hu: Legalább 8 számjegy szükséges ({0} található)
id: Diperlukan setidaknya 8 digit ({0} ditemukan)
it: Sono necessarie almeno 8 cifre (trovate: {0})
ja: 8 桁以上の数字が必要です (数字は {0} 桁)
ko: 8자리 이상의 숫자가 필요합니다({0}자리 있음)
pl: Wymagane jest co najmniej 8 cyfr (znaleziono: {0})
pt: São necessários pelo menos 8 dígitos (encontrados: {0})
ro: Sunt necesare cel puțin 8 cifre (găsite: {0})
th: ต้องมีอย่างน้อย 8 หลัก (พบ {0} หลัก)
tr: En az 8 basamak gerekir ({0} bulundu)
uk: Потрібно щонайменше 8 цифр (знайдено: {0})
vi: Cần ít nhất 8 chữ số (tìm thấy {0})
zh_hans: 至少需要 8 位数字（找到 {0} 位）
zh_hant: 至少需要 8 位數（找到 {0} 位）

# Inspector_DigitsUnixSeconds
source: Unix seconds
ar: ثوانٍ Unix
cs: Sekundy Unix
de: Unix-Sekunden
el: Δευτερόλεπτα Unix
es: Segundos Unix
fa: ثانیهٔ Unix
fr: Secondes Unix
hu: Unix-másodperc
id: Detik Unix
it: Secondi Unix
ja: Unix 秒
ko: Unix 초
pl: Sekundy Unix
pt: Segundos Unix
ro: Secunde Unix
th: วินาที Unix
tr: Unix saniyesi
uk: Секунди Unix
vi: Giây Unix
zh_hans: Unix 秒
zh_hant: Unix 秒

# Inspector_DigitsUnixMilliseconds
source: Unix milliseconds
ar: أجزاء الألف من الثانية Unix
cs: Milisekundy Unix
de: Unix-Millisekunden
el: Χιλιοστά δευτερολέπτου Unix
es: Milisegundos Unix
fa: میلی‌ثانیهٔ Unix
fr: Millisecondes Unix
hu: Unix-ezredmásodperc
id: Milidetik Unix
it: Millisecondi Unix
ja: Unix ミリ秒
ko: Unix 밀리초
pl: Milisekundy Unix
pt: Milissegundos Unix
ro: Milisecunde Unix
th: มิลลิวินาที Unix
tr: Unix milisaniyesi
uk: Мілісекунди Unix
vi: Mili giây Unix
zh_hans: Unix 毫秒
zh_hant: Unix 毫秒

# Inspector_InvalidDigits
source: Invalid
ar: غير صالح
cs: Neplatné
de: Ungültig
el: Μη έγκυρο
es: No válido
fa: نامعتبر
fr: Non valide
hu: Érvénytelen
id: Tidak valid
it: Non valido
ja: 不正
ko: 잘못됨
pl: Nieprawidłowe
pt: Inválido
ro: Nevalid
th: ไม่ถูกต้อง
tr: Geçersiz
uk: Неприпустимо
vi: Không hợp lệ
zh_hans: 无效
zh_hant: 無效

# Inspector_ErrorVarIntLength
source: The byte count would change, so the value can't be written (was {0} bytes, now {1} bytes)
ar: سيتغير عدد البايتات، لذا لا يمكن كتابة القيمة (كان {0} بايت، والآن {1} بايت)
cs: Změnil by se počet bajtů, proto hodnotu nelze zapsat (bylo bajtů: {0}, nyní: {1})
de: Die Byteanzahl würde sich ändern, daher kann der Wert nicht geschrieben werden (vorher {0} Bytes, jetzt {1} Bytes)
el: Ο αριθμός byte θα άλλαζε, επομένως η τιμή δεν μπορεί να γραφτεί (ήταν {0} byte, τώρα {1} byte)
es: El número de bytes cambiaría, por lo que no se puede escribir el valor (antes {0} bytes, ahora {1} bytes)
fa: تعداد بایت‌ها تغییر می‌کند، بنابراین مقدار قابل نوشتن نیست (قبلاً {0} بایت، اکنون {1} بایت)
fr: Le nombre d'octets changerait ; la valeur ne peut donc pas être écrite (avant : {0} octets, maintenant : {1} octets)
hu: A bájtok száma megváltozna, ezért az érték nem írható (eddig {0} bájt, most {1} bájt)
id: Jumlah byte akan berubah, sehingga nilai tidak dapat ditulis (sebelumnya {0} byte, sekarang {1} byte)
it: Il numero di byte cambierebbe, quindi il valore non può essere scritto (prima {0} byte, ora {1} byte)
ja: バイト数が変わるため書き込めません (元: {0} バイト、新: {1} バイト)
ko: 바이트 수가 바뀌므로 값을 쓸 수 없습니다(이전 {0}바이트, 현재 {1}바이트)
pl: Liczba bajtów uległaby zmianie, więc nie można zapisać wartości (było bajtów: {0}, teraz: {1})
pt: O número de bytes mudaria, por isso o valor não pode ser gravado (antes {0} bytes, agora {1} bytes)
ro: Numărul de octeți s-ar modifica, așa că valoarea nu poate fi scrisă (erau {0} octeți, acum {1} octeți)
th: จำนวนไบต์จะเปลี่ยนไป จึงเขียนค่าไม่ได้ (เดิม {0} ไบต์ ตอนนี้ {1} ไบต์)
tr: Bayt sayısı değişeceğinden değer yazılamaz (önce {0} bayt, şimdi {1} bayt)
uk: Зміниться кількість байтів, тому значення не можна записати (було {0} байтів, стало {1} байтів)
vi: Số byte sẽ thay đổi nên không thể ghi giá trị (trước {0} byte, giờ {1} byte)
zh_hans: 字节数会发生变化，因此无法写入该值（原为 {0} 字节，现为 {1} 字节）
zh_hant: 位元組數會改變，因此無法寫入此值（原為 {0} 個位元組，現為 {1} 個位元組）

# Inspector_ErrorStringTooLong
source: Longer than the original length ({0} bytes)
ar: أطول من الطول الأصلي ({0} بايت)
cs: Delší než původní délka ({0} B)
de: Länger als die ursprüngliche Länge ({0} Bytes)
el: Μεγαλύτερο από το αρχικό μήκος ({0} byte)
es: Supera la longitud original ({0} bytes)
fa: طولانی‌تر از طول اصلی ({0} بایت)
fr: Plus long que la longueur d'origine ({0} octets)
hu: Hosszabb az eredeti hossznál ({0} bájt)
id: Lebih panjang dari panjang asli ({0} byte)
it: Più lunga della lunghezza originale ({0} byte)
ja: 元の長さ ({0} バイト) を超えています
ko: 원래 길이({0}바이트)보다 깁니다
pl: Dłuższy niż oryginalna długość (bajtów: {0})
pt: Maior que o comprimento original ({0} bytes)
ro: Mai lung decât lungimea originală ({0} octeți)
th: ยาวกว่าความยาวเดิม ({0} ไบต์)
tr: Özgün uzunluktan ({0} bayt) uzun
uk: Довше за вихідну довжину ({0} байтів)
vi: Dài hơn độ dài ban đầu ({0} byte)
zh_hans: 超过原始长度（{0} 字节）
zh_hant: 超過原始長度（{0} 個位元組）

# Inspector_ErrorNotTerminated
source: The original string has no terminator, so its length is unknown
ar: السلسلة الأصلية بلا حرف إنهاء، لذا طولها غير معروف
cs: Původní řetězec nemá ukončovací znak, proto jeho délka není známa
de: Die ursprüngliche Zeichenfolge hat kein Abschlusszeichen, daher ist ihre Länge unbekannt
el: Η αρχική συμβολοσειρά δεν έχει τερματιστή, επομένως το μήκος της είναι άγνωστο
es: La cadena original no tiene terminador, por lo que se desconoce su longitud
fa: رشتهٔ اصلی پایان‌دهنده ندارد، بنابراین طول آن نامعلوم است
fr: La chaîne d'origine n'a pas de terminateur ; sa longueur est donc inconnue
hu: Az eredeti karakterláncnak nincs lezáró karaktere, ezért a hossza ismeretlen
id: String asli tidak memiliki terminator, sehingga panjangnya tidak diketahui
it: La stringa originale non ha un terminatore, quindi la sua lunghezza è sconosciuta
ja: 元の文字列に終端がないため、長さが分かりません
ko: 원래 문자열에 종결자가 없어 길이를 알 수 없습니다
pl: Oryginalny ciąg nie ma terminatora, więc jego długość jest nieznana
pt: A cadeia original não tem terminador, por isso seu comprimento é desconhecido
ro: Șirul original nu are terminator, așa că lungimea sa este necunoscută
th: สตริงเดิมไม่มีตัวสิ้นสุด จึงไม่ทราบความยาว
tr: Özgün dizenin sonlandırıcısı olmadığından uzunluğu bilinmiyor
uk: Вихідний рядок не має завершального символу, тому його довжина невідома
vi: Chuỗi ban đầu không có ký tự kết thúc nên không biết độ dài
zh_hans: 原始字符串没有结束符，因此长度未知
zh_hant: 原始字串沒有結尾字元，因此長度不明

# Inspector_ErrorColor
source: Enter a color such as #FF8000 or #FF8000FF
ar: أدخل لونًا مثل #FF8000 أو #FF8000FF
cs: Zadejte barvu, například #FF8000 nebo #FF8000FF
de: Geben Sie eine Farbe wie #FF8000 oder #FF8000FF ein
el: Εισαγάγετε χρώμα όπως #FF8000 ή #FF8000FF
es: Escribe un color como #FF8000 o #FF8000FF
fa: رنگی مانند #FF8000 یا #FF8000FF وارد کنید
fr: Entrez une couleur telle que #FF8000 ou #FF8000FF
hu: Adjon meg egy színt, például #FF8000 vagy #FF8000FF
id: Masukkan warna seperti #FF8000 atau #FF8000FF
it: Immetti un colore come #FF8000 o #FF8000FF
ja: 色は #FF8000 または #FF8000FF の形で入力してください
ko: #FF8000 또는 #FF8000FF와 같은 색을 입력하세요
pl: Wprowadź kolor, np. #FF8000 lub #FF8000FF
pt: Insira uma cor como #FF8000 ou #FF8000FF
ro: Introduceți o culoare, de ex. #FF8000 sau #FF8000FF
th: ป้อนสี เช่น #FF8000 หรือ #FF8000FF
tr: #FF8000 veya #FF8000FF gibi bir renk girin
uk: Введіть колір, наприклад #FF8000 або #FF8000FF
vi: Hãy nhập màu như #FF8000 hoặc #FF8000FF
zh_hans: 请输入颜色，例如 #FF8000 或 #FF8000FF
zh_hant: 請輸入色彩，例如 #FF8000 或 #FF8000FF

# Inspector_ErrorEscape
source: Invalid escape sequence (use \n, \t, \0, \xNN, \" or \\)
ar: تسلسل هروب غير صالح (استخدم \n أو \t أو \0 أو \xNN أو \" أو \\)
cs: Neplatná řídicí sekvence (použijte \n, \t, \0, \xNN, \" nebo \\)
de: Ungültige Escapesequenz (verwenden Sie \n, \t, \0, \xNN, \" oder \\)
el: Μη έγκυρη ακολουθία διαφυγής (χρησιμοποιήστε \n, \t, \0, \xNN, \" ή \\)
es: Secuencia de escape no válida (usa \n, \t, \0, \xNN, \" o \\)
fa: دنبالهٔ گریز نامعتبر است (از \n، \t، \0، \xNN، \" یا \\ استفاده کنید)
fr: Séquence d'échappement non valide (utilisez \n, \t, \0, \xNN, \" ou \\)
hu: Érvénytelen escape-szekvencia (használható: \n, \t, \0, \xNN, \" vagy \\)
id: Urutan escape tidak valid (gunakan \n, \t, \0, \xNN, \" atau \\)
it: Sequenza di escape non valida (usa \n, \t, \0, \xNN, \" o \\)
ja: エスケープの書き方が正しくありません (\n、\t、\0、\xNN、\"、\\ を使えます)
ko: 잘못된 이스케이프 시퀀스입니다(\n, \t, \0, \xNN, \" 또는 \\ 사용)
pl: Nieprawidłowa sekwencja ucieczki (użyj \n, \t, \0, \xNN, \" lub \\)
pt: Sequência de escape inválida (use \n, \t, \0, \xNN, \" ou \\)
ro: Secvență escape nevalidă (utilizați \n, \t, \0, \xNN, \" sau \\)
th: ลำดับ Escape ไม่ถูกต้อง (ใช้ \n, \t, \0, \xNN, \" หรือ \\)
tr: Geçersiz kaçış dizisi (\n, \t, \0, \xNN, \" veya \\ kullanın)
uk: Неприпустима escape-послідовність (використовуйте \n, \t, \0, \xNN, \" або \\)
vi: Chuỗi thoát không hợp lệ (dùng \n, \t, \0, \xNN, \" hoặc \\)
zh_hans: 无效的转义序列（请使用 \n、\t、\0、\xNN、\" 或 \\）
zh_hant: 無效的逸出序列（請使用 \n、\t、\0、\xNN、\" 或 \\）

# Inspector_ErrorDigits
source: The value needs {1} digits, but the original has {0}
ar: تحتاج القيمة إلى {1} أرقام، لكن الأصلية تحتوي على {0}
cs: Hodnota potřebuje {1} číslic, ale původní jich má {0}
de: Der Wert benötigt {1} Ziffern, das Original hat jedoch {0}
el: Η τιμή χρειάζεται {1} ψηφία, αλλά η αρχική έχει {0}
es: El valor necesita {1} dígitos, pero el original tiene {0}
fa: مقدار به {1} رقم نیاز دارد، اما مقدار اصلی {0} رقم دارد
fr: La valeur nécessite {1} chiffres, mais l'original en a {0}
hu: Az értékhez {1} számjegy kell, de az eredeti {0} számjegyből áll
id: Nilai memerlukan {1} digit, tetapi aslinya memiliki {0}
it: Il valore richiede {1} cifre, ma l'originale ne ha {0}
ja: 元は {0} 桁ですが、この値は {1} 桁になります
ko: 이 값은 {1}자리가 필요하지만 원래 값은 {0}자리입니다
pl: Wartość wymaga cyfr: {1}, ale oryginał ma ich: {0}
pt: O valor precisa de {1} dígitos, mas o original tem {0}
ro: Valoarea necesită {1} cifre, dar originalul are {0}
th: ค่านี้ต้องใช้ {1} หลัก แต่ค่าเดิมมี {0} หลัก
tr: Değer {1} basamak gerektiriyor ancak özgün değerde {0} basamak var
uk: Значенню потрібно {1} цифр, а у вихідному їх {0}
vi: Giá trị cần {1} chữ số, nhưng bản gốc có {0}
zh_hans: 该值需要 {1} 位数字，但原始值为 {0} 位
zh_hant: 此值需要 {1} 位數，但原始值為 {0} 位

# Inspector_PickColorName
source: Choose a color
ar: اختيار لون
cs: Zvolit barvu
de: Farbe auswählen
el: Επιλογή χρώματος
es: Elegir un color
fa: انتخاب رنگ
fr: Choisir une couleur
hu: Szín kiválasztása
id: Pilih warna
it: Scegli un colore
ja: 色を選ぶ
ko: 색 선택
pl: Wybierz kolor
pt: Escolher uma cor
ro: Alegeți o culoare
th: เลือกสี
tr: Renk seçin
uk: Виберіть колір
vi: Chọn màu
zh_hans: 选择颜色
zh_hant: 選擇色彩

# Inspector_WriteColor
source: Write
ar: كتابة
cs: Zapsat
de: Schreiben
el: Εγγραφή
es: Escribir
fa: نوشتن
fr: Écrire
hu: Írás
id: Tulis
it: Scrivi
ja: 書き込む
ko: 쓰기
pl: Zapisz
pt: Gravar
ro: Scriere
th: เขียน
tr: Yaz
uk: Записати
vi: Ghi
zh_hans: 写入
zh_hant: 寫入

# Inspector_FixedLabel.Text
source: Add a fixed-point row
ar: إضافة صف بفاصلة ثابتة
cs: Přidat řádek s pevnou řádovou čárkou
de: Festkommazeile hinzufügen
el: Προσθήκη γραμμής σταθερής υποδιαστολής
es: Agregar una fila de punto fijo
fa: افزودن سطر ممیز ثابت
fr: Ajouter une ligne à virgule fixe
hu: Fixpontos sor hozzáadása
id: Tambah baris titik tetap
it: Aggiungi una riga a virgola fissa
ja: 固定小数点の行を加える
ko: 고정 소수점 행 추가
pl: Dodaj wiersz stałoprzecinkowy
pt: Adicionar uma linha de ponto fixo
ro: Adăugare rând virgulă fixă
th: เพิ่มแถวจุดตรึง
tr: Sabit noktalı satır ekle
uk: Додати рядок із фіксованою комою
vi: Thêm hàng dấu phẩy tĩnh
zh_hans: 添加定点数行
zh_hant: 新增定點數列

# Inspector_FixedSignedBox.Content
source: Signed
ar: بإشارة
cs: Se znaménkem
de: Mit Vorzeichen
el: Με πρόσημο
es: Con signo
fa: علامت‌دار
fr: Signé
hu: Előjeles
id: Bertanda
it: Con segno
ja: 符号あり
ko: 부호 있음
pl: Ze znakiem
pt: Com sinal
ro: Cu semn
th: มีเครื่องหมาย
tr: İşaretli
uk: Зі знаком
vi: Có dấu
zh_hans: 有符号
zh_hant: 帶正負號

# Inspector_FixedSignedBox.AutomationProperties.Name
source: Signed
ar: بإشارة
cs: Se znaménkem
de: Mit Vorzeichen
el: Με πρόσημο
es: Con signo
fa: علامت‌دار
fr: Signé
hu: Előjeles
id: Bertanda
it: Con segno
ja: 符号あり
ko: 부호 있음
pl: Ze znakiem
pt: Com sinal
ro: Cu semn
th: มีเครื่องหมาย
tr: İşaretli
uk: Зі знаком
vi: Có dấu
zh_hans: 有符号
zh_hant: 帶正負號

# Inspector_FixedTotalName
source: Total bits
ar: إجمالي البتات
cs: Celkem bitů
de: Bits gesamt
el: Συνολικά bit
es: Bits totales
fa: کل بیت‌ها
fr: Nombre total de bits
hu: Összes bit
id: Total bit
it: Bit totali
ja: 全体のビット数
ko: 전체 비트 수
pl: Liczba bitów
pt: Total de bits
ro: Total biți
th: จำนวนบิตทั้งหมด
tr: Toplam bit
uk: Усього бітів
vi: Tổng số bit
zh_hans: 总位数
zh_hant: 總位元數

# Inspector_FixedFractionName
source: Fraction bits
ar: بتات الكسر
cs: Bity zlomkové části
de: Nachkommabits
el: Bit κλασματικού μέρους
es: Bits fraccionarios
fa: بیت‌های کسری
fr: Bits de la partie fractionnaire
hu: Törtrész bitjei
id: Bit pecahan
it: Bit frazionari
ja: 小数部のビット数
ko: 소수부 비트 수
pl: Bity części ułamkowej
pt: Bits fracionários
ro: Biți fracționari
th: จำนวนบิตส่วนทศนิยม
tr: Kesir bitleri
uk: Бітів дробової частини
vi: Số bit phần thập phân
zh_hans: 小数位数
zh_hant: 小數位元數

# Inspector_AddFixed.Content
source: Add
ar: إضافة
cs: Přidat
de: Hinzufügen
el: Προσθήκη
es: Agregar
fa: افزودن
fr: Ajouter
hu: Hozzáadás
id: Tambah
it: Aggiungi
ja: 加える
ko: 추가
pl: Dodaj
pt: Adicionar
ro: Adăugare
th: เพิ่ม
tr: Ekle
uk: Додати
vi: Thêm
zh_hans: 添加
zh_hant: 新增

# Inspector_RemoveFixed.Content
source: Remove row
ar: إزالة الصف
cs: Odebrat řádek
de: Zeile entfernen
el: Κατάργηση γραμμής
es: Quitar fila
fa: حذف سطر
fr: Supprimer la ligne
hu: Sor eltávolítása
id: Hapus baris
it: Rimuovi riga
ja: 行を外す
ko: 행 제거
pl: Usuń wiersz
pt: Remover linha
ro: Eliminare rând
th: ลบแถว
tr: Satırı kaldır
uk: Видалити рядок
vi: Xóa hàng
zh_hans: 删除行
zh_hant: 移除列

# Inspector_FixedInvalid
source: The fraction bits must be 0 to {0}
ar: يجب أن تكون بتات الكسر من 0 إلى {0}
cs: Počet bitů zlomkové části musí být 0 až {0}
de: Die Nachkommabits müssen zwischen 0 und {0} liegen
el: Τα bit κλασματικού μέρους πρέπει να είναι από 0 έως {0}
es: Los bits fraccionarios deben estar entre 0 y {0}
fa: بیت‌های کسری باید از 0 تا {0} باشد
fr: Les bits de la partie fractionnaire doivent être compris entre 0 et {0}
hu: A törtrész bitjeinek száma 0 és {0} között lehet
id: Bit pecahan harus 0 hingga {0}
it: I bit frazionari devono essere compresi tra 0 e {0}
ja: 小数部のビット数は 0〜{0} にしてください
ko: 소수부 비트 수는 0~{0}이어야 합니다
pl: Liczba bitów części ułamkowej musi wynosić od 0 do {0}
pt: Os bits fracionários devem estar entre 0 e {0}
ro: Biții fracționari trebuie să fie între 0 și {0}
th: จำนวนบิตส่วนทศนิยมต้องอยู่ระหว่าง 0 ถึง {0}
tr: Kesir bitleri 0 ile {0} arasında olmalıdır
uk: Кількість бітів дробової частини має бути від 0 до {0}
vi: Số bit phần thập phân phải từ 0 đến {0}
zh_hans: 小数位数必须为 0 到 {0}
zh_hant: 小數位元數必須為 0 到 {0}

# Inspector_FixedLimit
source: Up to {0} fixed-point rows can be added
ar: يمكن إضافة {0} صفوف بفاصلة ثابتة كحد أقصى
cs: Lze přidat nejvýše {0} řádků s pevnou řádovou čárkou
de: Es können bis zu {0} Festkommazeilen hinzugefügt werden
el: Μπορούν να προστεθούν έως {0} γραμμές σταθερής υποδιαστολής
es: Se pueden agregar hasta {0} filas de punto fijo
fa: حداکثر {0} سطر ممیز ثابت می‌توان افزود
fr: Jusqu'à {0} lignes à virgule fixe peuvent être ajoutées
hu: Legfeljebb {0} fixpontos sor adható hozzá
id: Hingga {0} baris titik tetap dapat ditambahkan
it: È possibile aggiungere fino a {0} righe a virgola fissa
ja: 固定小数点の行は {0} 行までです
ko: 고정 소수점 행은 최대 {0}개까지 추가할 수 있습니다
pl: Można dodać maksymalnie tyle wierszy stałoprzecinkowych: {0}
pt: É possível adicionar até {0} linhas de ponto fixo
ro: Pot fi adăugate cel mult {0} rânduri cu virgulă fixă
th: เพิ่มแถวจุดตรึงได้สูงสุด {0} แถว
tr: En fazla {0} sabit noktalı satır eklenebilir
uk: Можна додати не більше {0} рядків із фіксованою комою
vi: Có thể thêm tối đa {0} hàng dấu phẩy tĩnh
zh_hans: 最多可以添加 {0} 个定点数行
zh_hant: 最多可新增 {0} 個定點數列

# Bookmark_Group.Header
source: Group
ar: المجموعة
cs: Skupina
de: Gruppe
el: Ομάδα
es: Grupo
fa: گروه
fr: Groupe
hu: Csoport
id: Grup
it: Gruppo
ja: グループ
ko: 그룹
pl: Grupa
pt: Grupo
ro: Grup
th: กลุ่ม
tr: Grup
uk: Група
vi: Nhóm
zh_hans: 组
zh_hant: 群組

# Bookmark_Group.AutomationProperties.Name
source: Group
ar: المجموعة
cs: Skupina
de: Gruppe
el: Ομάδα
es: Grupo
fa: گروه
fr: Groupe
hu: Csoport
id: Grup
it: Gruppo
ja: グループ
ko: 그룹
pl: Grupa
pt: Grupo
ro: Grup
th: กลุ่ม
tr: Grup
uk: Група
vi: Nhóm
zh_hans: 组
zh_hant: 群組

# Bookmark_GroupNone
source: (No group)
ar: (بلا مجموعة)
cs: (Bez skupiny)
de: (Keine Gruppe)
el: (Χωρίς ομάδα)
es: (Sin grupo)
fa: (بدون گروه)
fr: (Aucun groupe)
hu: (Nincs csoport)
id: (Tanpa grup)
it: (Nessun gruppo)
ja: (グループなし)
ko: (그룹 없음)
pl: (Brak grupy)
pt: (Sem grupo)
ro: (Fără grup)
th: (ไม่มีกลุ่ม)
tr: (Grup yok)
uk: (Без групи)
vi: (Không có nhóm)
zh_hans: （无组）
zh_hant: （無群組）
